---
layout: post
title:  "JSON конфигурация списка задач Hangfire и их runtime обновление"
date:   2016-06-17 23:30:29 +0300
category: dev
tags: [hangfire, scheduler]
---

Явное описание задач в коде делает их достаточно неповоротливыми и неудобными в поддержке. 
Также было бы явным излишеством описывать однотипные задачи.
Было бы удобнее хранить их минимальное описание с параметрами в отдельном файле с JSON или XML разметкой, 
который бы автоматически подгружался при старте планировщика и далее уже обновлял список при условии, если он был изменен. 
У известного планировщика Quartz, такая фича идет уже из коробки, но к сожалению, в Hangfire ее нет. 
<!-- more -->


Опишем общий интерфейс задачи.

```cs
public interface IJob
{
	void Execute(Dictionary<string, string> parameters);
}
```
